[
    {
        "id": 1,
        "name": "Internet of Things",
        "title": "Internet of Things or IoT is the interconnected network of physical objects embedded with sensors, software and connected to the internet. You will learn about sensors, actuators, communication protocols, etc.",
        "category": "Free",
        "image": "9913881.jpg"
    },

    {
        "id": 2,
        "name": "Data Structures and Algorithms",
        "title": "A Data Structures and Algorithms course is fundamental for computer science students, focusing on the efficient organization and manipulation of data. The course covers basic data structures like arrays, linked lists, stacks, and queues, as well as advanced structures such as trees (binary trees, AVL trees, heaps), graphs, and hash tables. Key algorithmic concepts include sorting and searching algorithms (quick sort, merge sort, binary search), dynamic programming, greedy algorithms, and divide and conquer techniques. Students learn to analyze algorithm efficiency using Big-O notation and design algorithms to solve complex problems efficiently. The course aims to enhance problem-solving skills and prepare students for technical interviews and advanced computer science topics by applying these data structures and algorithms in real-world scenarios.",
        "category": "Free",
        "image": "4412009.jpg"
    },

    {
        "id": 3,
        "name": "Discrete Mathematics",
        "title": "Discrete Mathematics is a fundamental area of mathematics that deals with discrete objects, meaning those that are distinct and separate (i.e., not continuous). This branch of mathematics is crucial for computer science, information theory, and related fields due to its applications in algorithm design, cryptography, network theory, and more. Learnings include set theory, logic and proof techniques, graph theory, algorithms and complexity etc.",
        "category": "Free",
        "image": "4542742.jpg"
    },

    {
        "id": 4,
        "name": "Data Structures and Algorithms",
        "title": "Learn how to solve a problem systematically. Learn about concepts involving linked lists, stacks, queues, heaps etc.",
        "category": "Free",
        "image": "4412009.jpg"
    },

    {
        "id": 5,
        "name": "Data Structures and Algorithms",
        "title": "Internet of Things or IoT is the interconnected network of physical objects embedded with sensors, software and connected to the internet. You will learn about sensors, actuators, communication protocols, etc.",
        "category": "Logged",
        "image": "dsaimg.jpeg"
    },

    {
        "id": 6,
        "name": "Data Structures and Algorithms",
        "title": "Internet of Things or IoT is the interconnected network of physical objects embedded with sensors, software and connected to the internet. You will learn about sensors, actuators, communication protocols, etc.",
        "category": "Logged",
        "image": "dsaimg.jpeg"
    },

    {
        "id": 7,
        "name": "Data Structures and Algorithms",
        "title": "Internet of Things or IoT is the interconnected network of physical objects embedded with sensors, software and connected to the internet. You will learn about sensors, actuators, communication protocols, etc.",
        "category": "Logged",
        "image": "dsaimg.jpeg"
    }
]